app/views/gardens/show.html.erb

  <div class="row mt-5">
    <% @garden.plants.each do |plant| %>
---
SELECT "plants".* FROM "plants" WHERE "plants"."garden_id" = ?  [["garden_id", 1]]