app/controllers/gardens_controller.rb

  def index
    @gardens = Garden.all
---
SELECT "gardens".* FROM "gardens"

  def show
    @garden = Garden.find(params[:id])
    @plants = @garden.plants
    @plant = Plant.new

    @plant_tag = Plant.find(params[:id])
---
SELECT "gardens".* FROM "gardens" WHERE "gardens"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def set_garden
      @garden = Garden.find(params[:id])
---
SELECT "gardens".* FROM "gardens" WHERE "gardens"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]